#language: ru

Функционал: Маркет

  Сценарий: Поиск телевизора
    Когда яндекс выбран пункт меню "Маркет"
    Когда яндекс выбран пункт меню маркета "Электроника"
    Когда яндекс выбраны телевизоры
    Когда яндекс выбран расширенный поиск Tv
    Когда яндекс указать цена от "20000"
    Когда яндекс указать брэнд "Samsung"
    Когда яндекс указать брэнд "LG"
    Когда яндекс применить фильтр
    Тогда яндекс проверка поиском TV

  Сценарий: Поиск телевизора наушников
    Когда яндекс выбран пункт меню "Маркет"
    Когда яндекс выбран пункт меню маркета "Электроника"
    Когда яндекс выбраны проводные наушники
    Когда яндекс выбран расширенный поиск Headphones
    Когда яндекс указать цена от "5000"
    Когда яндекс указать брэнд "Beats"
    Когда яндекс применить фильтр
    Тогда яндекс проверка поиском Headphones

